docs/class.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>Class</title>
<!-- 2017-03-11 土 22:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />


</head>
<body>
<div id="content">
<h1 class="title">Class</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Class BRAHMAN</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Class Precedence List:</h3>
<div class="outline-text-3" id="text-1-1">
<p>
t
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Description:</h3>
<div class="outline-text-3" id="text-1-2">
<p>
upanishad 内の全てのクラスのスーパークラス。。。
いやスーパークラスのスーパークラスかな。
</p>

<p>
梵我一如を表わすための思想的/象徴的なクラス。
</p>

<p>
BRAHMAN自体は実態を持たない。
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Slots</h3>
<div class="outline-text-3" id="text-1-3">
<p>
なし
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">See Also:</h3>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Class ATMAN</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Class Precedence List</h3>
<div class="outline-text-3" id="text-2-1">
<p>
BRAHMAN, t
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Description</h3>
<div class="outline-text-3" id="text-2-2">
<p>
upanishad 内の全てのクラスのスーパークラス。
</p>

<p>
梵我一如 を表わすための思想的/象徴的なクラス。
</p>

<p>
ATMAN は実態を持つ全てのもの。
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Slots</h3>
<div class="outline-text-3" id="text-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">slot</th>
<th scope="col" class="left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">%id</td>
<td class="left">an Integer. default -1</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1">%id</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
オブジェクトのプライマリキーとなるスロット。
</p>

<p>
いまのところ pool 毎に連番で採番している。
</p>

<p>
オブジェクト毎に採番したほうが良いのかとも思うが今はまだそのようになっていない。
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Class MEME</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Class Precedence List</h3>
<div class="outline-text-3" id="text-3-1">
<p>
ATMAN, t
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Description</h3>
<div class="outline-text-3" id="text-3-2">
<p>
このクラスも思想的/象徴的なクラスです。
</p>

<p>
まぁぶっちゃけ不要なんですけど。
</p>

<p>
オブジェクトを蓄積するクラスをPOOLとしたのでMEMEとしています。
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Slots</h3>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Class BLOB</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Class Precedence List</h3>
<div class="outline-text-3" id="text-4-1">
<p>
MEME, t
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">Description</h3>
<div class="outline-text-3" id="text-4-2">
<p>
A blob is a file-like collection of bytes with related metadata
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3">Slots</h3>
<div class="outline-text-3" id="text-4-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">slot</th>
<th scope="col" class="left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">name</td>
<td class="left">Return the descriptive name of blob. Set the descriptive name of blob.</td>
</tr>

<tr>
<td class="left">size</td>
<td class="left">Return the size of blob in bytes. Set the mime-type string of blob.</td>
</tr>

<tr>
<td class="left">mime-type</td>
<td class="left">Return the mime-type of blob as a string. Set the keywords list of blob</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">keywords</td>
<td class="left">Return the list of keywords associated with blob</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Class POOL</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Class Precedence List</h3>
<div class="outline-text-3" id="text-5-1">
<p>
brahman, t
</p>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">Description</h3>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">Slots</h3>
<div class="outline-text-3" id="text-5-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">slot</th>
<th scope="col" class="left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">root-objects</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">index-objects</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">memes</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">indexes</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">options</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">directory</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">snapshot</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">transaction-log</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">transaction-log-stream</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">serializer</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">deserializer</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">file-extension</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">serialization-state</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">transaction-hook</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Class GUARDED-POOL</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">Class Precedence List</h3>
<div class="outline-text-3" id="text-6-1">
<p>
brahman, t
</p>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2">Description</h3>
<div class="outline-text-3" id="text-6-2">
<p>
A Prevalence system with a guard thunk
</p>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3">Slots</h3>
<div class="outline-text-3" id="text-6-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">slot</th>
<th scope="col" class="left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">guard</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Class TRANSACTION</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1">Class Precedence List</h3>
<div class="outline-text-3" id="text-7-1">
<p>
brahman, t
</p>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2">Description</h3>
<div class="outline-text-3" id="text-7-2">
<p>
A simple Transaction object joining a function and its arguments
</p>
</div>
</div>

<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3">Slots</h3>
<div class="outline-text-3" id="text-7-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">slot</th>
<th scope="col" class="left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">args</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">function</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-03-11 土 22:26</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
